<?php
/**
 +-------------------------------------------------------
 * 测试用例控制器
 +-------------------------------------------------------
 * @version 1.0 
 * @copyright myphp.cn
 +-------------------------------------------------------
 * Main   框架默认执行的控制器
 * index  index：框架默认执行控制器中的动作
 +-------------------------------------------------------
 * 说明：该程序是由框架自己生成的
 +-------------------------------------------------------
 */
class Main extends Controller
{    
    public function index()
    {
        // 标题
		$data['title'] = "Hello MyPHP";		
		
		// 加载视图模板
		return View::parse('index.html' ,$data);
    }
}
?>